#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.kubeflow_cluster_1.ionoscloud_k8s_cluster.example will be created
  + resource "ionoscloud_k8s_cluster" "example" {
      + allow_replace             = false
      + id                        = (known after apply)
      + k8s_version               = "1.31.3"
      + name                      = "K8S-STAGING"
      + node_subnet               = (known after apply)
      + public                    = true
      + viable_node_pool_versions = (known after apply)

      + maintenance_window {
          + day_of_the_week = "Sunday"
          + time            = "09:00:00Z"
        }
    }

  # module.kubeflow_cluster_1.ionoscloud_k8s_node_pool.example will be created
  + resource "ionoscloud_k8s_node_pool" "example" {
      + allow_replace     = false
      + availability_zone = "AUTO"
      + cores_count       = 8
      + cpu_family        = "INTEL_SKYLAKE"
      + datacenter_id     = (sensitive value)
      + id                = (known after apply)
      + k8s_cluster_id    = (known after apply)
      + k8s_version       = "1.31.3"
      + name              = "k8sNodePool"
      + node_count        = 1
      + ram_size          = 30720
      + storage_size      = 100
      + storage_type      = "SSD"

      + maintenance_window {
          + day_of_the_week = "Monday"
          + time            = "09:00:00Z"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @Safarveisi, Action: `pull_request`*